SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
#include "raw_image.h"
/**
 * @file    app_thread.c
 * @brief   Multi-threaded Camera + Sensor + Storage
 */

#include <stdio.h>
#include <string.h>
#include "app_thread.h"
#include "app_config.h"
#include "app_cam.h"
#include "perf_debug.h"
#include "vl53l5cx_detection.h"
#include "ws2812.h"
#include "stm32n6xx_hal.h"
#include "stm32n6570_discovery.h"
#include "main.h"

/* Count camera activations; in the 4x4 camera path three distinct captures
   request a baseline refresh only after the scene has become quiet. */
#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
#define TOF_CAPTURE_ACTIVATION_REFRESH 1
#if !VL53L5CX_DUAL_SENSOR && !TEST_TOF_MODE && \
    (VL53L5CX_DET_RESOLUTION == 4) && VL53L5CX_DET_HIGH_SENS_CAMERA
#define TOF_CAPTURE_REFRESH_WINDOW_SECS VL53L5CX_DET_HIGH_SENS_REFRESH_WINDOW_SECS
#define TOF_CAPTURE_MAX_DETECTIONS      VL53L5CX_DET_HIGH_SENS_MAX_DETECTIONS
#define TOF_CAPTURE_REARM_HOLDOFF_SECS  VL53L5CX_DET_HIGH_SENS_REARM_HOLDOFF_SECS
#else
#define TOF_CAPTURE_REFRESH_WINDOW_SECS VL53L5CX_DET_REFRESH_WINDOW_SECS
#define TOF_CAPTURE_MAX_DETECTIONS      VL53L5CX_DET_MAX_DETECTIONS
#define TOF_CAPTURE_REARM_HOLDOFF_SECS  0
#endif

#if !VL53L5CX_DUAL_SENSOR && !TEST_TOF_MODE && \
    (VL53L5CX_DET_RESOLUTION == 4) && VL53L5CX_DET_HIGH_SENS_CAMERA
#define TOF_SCENE_GROUPING 1
/* Include the event zone and its immediate neighbours in the same scene. */
static uint16_t ToFSceneNeighbours(uint16_t mask)
{
    uint16_t nearby = mask;
    for (uint8_t z = 0U; z < 16U; z++) {
        if ((mask & (uint16_t)(1U << z)) == 0U) continue;
        for (uint8_t n = 0U; n < 16U; n++) {
            int row = (int)(z / 4U) - (int)(n / 4U);
            int col = (int)(z % 4U) - (int)(n % 4U);
            if (row >= -1 && row <= 1 && col >= -1 && col <= 1)
                nearby |= (uint16_t)(1U << n);
        }
    }
    return nearby;
}
#else
#define TOF_SCENE_GROUPING 0
#endif
#else
#define TOF_CAPTURE_ACTIVATION_REFRESH 0
#define TOF_CAPTURE_REARM_HOLDOFF_SECS  0
#endif

extern I2C_HandleTypeDef hi2c1;
extern uint8_t capture_buf[];
#if CAPTURE_MODE == 1
extern uint8_t save_buf[];
#endif
#if CAPTURE_MODE == 2 || CAPTURE_MODE == 4
extern uint8_t batch_buf[];
#endif

QueueHandle_t    camera_cmd_queue   = NULL;
QueueHandle_t    storage_cmd_queue  = NULL;
QueueHandle_t    sensor_event_queue = NULL;
SemaphoreHandle_t camera_ready_sem  = NULL;
SemaphoreHandle_t storage_done_sem  = NULL;
volatile SensorState_t g_sensor_state = SENSOR_STATE_IDLE;

static volatile int g_capture_busy = 0;
static volatile int g_last_storage_rc = 0;
static volatile int g_last_batch_frames = 0;
/* Camera task reserves IDs before dispatch; failed writes leave an ID gap. */
static uint32_t g_next_snap_id = 0;
static uint32_t g_sd_img_base_block;
#define SD_IMG_HEADER_SIZE  64
#define SD_BLOCK_SIZE       512
static uint32_t g_debug_frame_count = 0;



extern SD_HandleTypeDef hsd1;
extern uint8_t sd_batch_buf[];
PerfTimer_t g_perf_timer;

/* DS3231 gives UTC at one-second resolution. Mode 4 keeps that UTC anchor
   and replaces only capture_tick with the exact completion tick of each frame. */
static RTC_Stamp RTC_StampForFrame(RTC_Stamp stamp, uint32_t frame_tick)
{
    if (frame_tick != 0U) stamp.capture_tick = frame_tick;
    return stamp;
}

/* ==================== IPC ==================== */
BaseType_t IPC_Init(void)
{
    camera_cmd_queue = xQueueCreate(CAMERA_CMD_QUEUE_LEN, sizeof(CameraCmd_t));
    if (!camera_cmd_queue) return pdFALSE;
    storage_cmd_queue = xQueueCreate(STORAGE_CMD_QUEUE_LEN, sizeof(StorageCmd_t));
    if (!storage_cmd_queue) return pdFALSE;
    sensor_event_queue = xQueueCreate(SENSOR_EVENT_QUEUE_LEN, sizeof(CameraEvent_typed));
    if (!sensor_event_queue) return pdFALSE;
    camera_ready_sem = xSemaphoreCreateBinary();
    if (!camera_ready_sem) return pdFALSE;
    storage_done_sem = xSemaphoreCreateCounting(STORAGE_CMD_QUEUE_LEN, 0);
    if (!storage_done_sem) return pdFALSE;
    xSemaphoreTake(camera_ready_sem, 0);
    xSemaphoreTake(storage_done_sem, 0);
    g_sd_img_base_block = SD_SNAP_BASE_BLOCK;
    printf("[IPC] OK\n");
    return pdTRUE;
}

void IPC_Deinit(void)
{
    if (camera_cmd_queue) vQueueDelete(camera_cmd_queue);
    if (storage_cmd_queue) vQueueDelete(storage_cmd_queue);
    if (sensor_event_queue) vQueueDelete(sensor_event_queue);
    if (camera_ready_sem) vSemaphoreDelete(camera_ready_sem);
    if (storage_done_sem) vSemaphoreDelete(storage_done_sem);
}

int Capture_IsBusy(void) { return g_capture_busy; }

BaseType_t Capture_RequestSnapOnly(void)
{
    CameraCmd_t cmd = {0}; cmd.type = CAM_CMD_SNAP;
    return xQueueSend(camera_cmd_queue, &cmd, pdMS_TO_TICKS(100));
}

/* ==================== SD AUTO-RECOVERY ==================== */
/* NOTE: Not static — called from main.c (btn_thread) as well as storage_task. */
int SD_Reinit(void)
{
#if PERF_DEBUG_LEVEL >= 1
    printf("[SD] === SD RECOVERY STARTED ===\n");
#endif
    uint32_t saved_block = g_sd_img_base_block;
    HAL_SD_Abort(&hsd1);
    HAL_SD_DeInit(&hsd1);
    vTaskDelay(pdMS_TO_TICKS(100));
    __HAL_RCC_SDMMC2_FORCE_RESET();
    vTaskDelay(pdMS_TO_TICKS(10));
    __HAL_RCC_SDMMC2_RELEASE_RESET();
    vTaskDelay(pdMS_TO_TICKS(10));
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_SDMMC2;
    PeriphClkInit.Sdmmc2ClockSelection  = RCC_SDMMC2CLKSOURCE_HCLK;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);
    hsd1.Instance             = SDMMC2;
    hsd1.Init.ClockEdge       = SDMMC_CLOCK_EDGE_RISING;
    hsd1.Init.ClockPowerSave  = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    hsd1.Init.BusWide         = SDMMC_BUS_WIDE_4B;
    hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd1.Init.ClockDiv        = 2;
    hsd1.State                = HAL_SD_STATE_RESET;
    HAL_SD_MspInit(&hsd1);
    HAL_StatusTypeDef status = HAL_SD_Init(&hsd1);
    if (status == HAL_OK) {
        status = HAL_SD_ConfigWideBusOperation(&hsd1, SDMMC_BUS_WIDE_4B);
        if (status == HAL_OK) { hsd1.Init.BusWide = SDMMC_BUS_WIDE_4B; }
    }
    g_sd_img_base_block = saved_block;
    if (status == HAL_OK) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] Recovery OK! Next write from block %lu\n", (unsigned long)g_sd_img_base_block);
#endif
        return 0;
    } else {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] Recovery FAILED (HAL=0x%08lX)\n", (unsigned long)status);
#endif
        return -1;
    }
}

