SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
    /* Announce the selected sleep/wake baseline refresh strategy so
       the console makes it obvious when the cycle refresh is off. */
#if VL53L5CX_DUAL_BASELINE_MODE == VL53L5CX_BASELINE_NO_REFRESH
    printf("[PRIMARY] Baseline mode: NO_REFRESH - cycle refresh DISABLED\n");
#elif VL53L5CX_DUAL_BASELINE_MODE == VL53L5CX_BASELINE_PRE_SLEEP
    printf("[PRIMARY] Baseline mode: PRE_SLEEP - re-learn before sleep\n");
#else
    printf("[PRIMARY] Baseline mode: QUICK_WAKE - re-learn on wake\n");
#endif
#endif

    /* Only fail if PRIMARY sensor baseline is not ready (external is optional) */
    if (!VL53L5CX_IsBaselineReady()) {
        g_sensor_state = SENSOR_STATE_STOPPED;
        printf("[ERROR] Primary ToF baseline not ready!\n");
        while (1) vTaskDelay(pdMS_TO_TICKS(1000));
    }

    g_sensor_state = SENSOR_STATE_RUNNING;
    printf("[SENSOR] Running\n");
    uint32_t capture_count = 0, cooldown = 0;
#if TOF_CAPTURE_ACTIVATION_REFRESH
    uint8_t consecutive_captures = 0;
    uint8_t consecutive_window_active = 0;
    TickType_t consecutive_window_start = 0;
#endif
#if TOF_SCENE_GROUPING
    uint16_t captured_scene_mask = 0U;
    uint8_t scene_quiet_frames = 0U;
    uint8_t adaptive_refresh_pending = 0U;
#endif
#if TOF_CAPTURE_REARM_HOLDOFF_SECS > 0
    uint8_t capture_rearm_holdoff_active = 0;
    TickType_t capture_rearm_holdoff_start = 0;
#endif
#if TEST_TOF_MODE && VL53L5CX_DET_ZONE_SURVEY && !VL53L5CX_DUAL_SENSOR && \
    (VL53L5CX_DET_RESOLUTION == 4) && \
    (VL53L5CX_DET_ZONE_LOG_INTERVAL_MS > 0)
    TickType_t zone_log_last = xTaskGetTickCount();
#endif

    while (1) {
        if (g_sensor_state == SENSOR_STATE_PAUSED) { vTaskDelay(pdMS_TO_TICKS(50)); continue; }

#if TEST_TOF_MODE
        /* ---- Manual baseline refresh via USER button (PC13) ----
           TEST build only: one press = one full refresh of the primary
           baseline and, in dual mode, the external guardian baseline as
           well (see VL53L5CX_RefreshBaseline_Manual()). Debounced and
           edge-triggered — re-arms once the button is released. The RED
           LED stays on for the whole refresh (a few seconds). */
        static uint8_t btn_refresh_armed = 1;
        if (btn_refresh_armed &&
            HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET) {
            vTaskDelay(pdMS_TO_TICKS(BTN_DEBOUNCE_MS));
            if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET) {
                btn_refresh_armed = 0;
                printf("[BTN] PC13 pressed — refreshing baseline(s)...\n");
                BSP_LED_Off(LED_GREEN);
                BSP_LED_On(LED_RED);
                VL53L5CX_RefreshBaseline_Manual();
                BSP_LED_Off(LED_RED);
                BSP_LED_On(LED_GREEN);
                while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                    vTaskDelay(pdMS_TO_TICKS(50));
                btn_refresh_armed = 1;
            }
        }
#endif

#if VL53L5CX_DUAL_SENSOR
        /* ---- DUAL SENSOR MODE ----
           External sensor is always ON, monitoring for motion/signal drop.
           Primary sensor (camera ToF) is in sleep mode by default.
           When external detects something, it wakes the primary. */

        /* Cooldown countdown, one step per loop iteration (same as single-sensor
           mode). Without this, cooldown latches at 30 after the first capture
           and blocks every subsequent trigger, even when raw data shows the
           signal drop above threshold. */
        if (cooldown > 0) cooldown--;

        /* Update external (guardian) sensor continuously */
        if (VL53L5CX_External_GetState() == EXTERNAL_STATE_MONITORING) {
            (void)VL53L5CX_External_Update();
        }

        /* Check primary sensor wake timeout */
        VL53L5CX_Primary_CheckWakeTimeout();

        /* When primary is active, also update it for detection */
        if (VL53L5CX_Primary_IsActive()) {
            if (!VL53L5CX_Update()) {
                vTaskDelay(pdMS_TO_TICKS(10));
            }

#if TOF_CAPTURE_ACTIVATION_REFRESH
            if (consecutive_window_active &&
                (xTaskGetTickCount() - consecutive_window_start) >=
                    pdMS_TO_TICKS(TOF_CAPTURE_REFRESH_WINDOW_SECS * 1000UL)) {
                consecutive_captures = 0;
                consecutive_window_active = 0;
                printf("[ADAPT] Window expired, counter reset\n");
            }
#endif

            /* Check primary sensor detection while it's awake */
            if (VL53L5CX_IsInsectDetected() && cooldown == 0) {
                if (g_capture_busy) { vTaskDelay(pdMS_TO_TICKS(5)); continue; }
                g_capture_busy = 1;
                g_sensor_state = SENSOR_STATE_PAUSED;
                VL53L5CX_DetectionResult_t res = VL53L5CX_GetResult();

#if PERF_DEBUG_LEVEL >= 1
                const char* trig_str;
                if (res.trigger_source == 1) trig_str = "SIGNAL";
                else if (res.trigger_source == 2) trig_str = "MOTION";
                else if (res.trigger_source == 3) trig_str = "SIGNAL+MOTION";
                else if (res.trigger_source == 4) trig_str = "DISTANCE";
                else if (res.trigger_source == 5) trig_str = "SIGNAL+DISTANCE";
                else if (res.trigger_source == 6) trig_str = "MOTION+DISTANCE";
                else if (res.trigger_source == 7) trig_str = "SIGNAL+MOTION+DISTANCE";
                else trig_str = "UNKNOWN";
                printf(">>> INSECT DETECTED (Primary, woken by external) [%s]!\n", trig_str);
#endif

#if TEST_TOF_MODE
                /* === ON-SITE TEST MODE: no camera, no SD — RED LED only === */
                printf(">>> TEST: %u zone(s) affected, %u valid\r\n",
                       (unsigned)res.affected_count, (unsigned)res.valid_measurements);
                for (int a = 0; a < res.affected_count; a++)
                    printf("    zone %u -> %lu\r\n", (unsigned)res.affected_zones[a],
                           (unsigned long)res.affected_drop[a]);
                BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
                vTaskDelay(pdMS_TO_TICKS(TEST_TOF_LED_MS));
                BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
                g_sensor_state = SENSOR_STATE_RUNNING;
                g_capture_busy = 0;
                cooldown = 30;
                continue;
#else
                BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
#if WS2812_MODE == 1
                WS2812_FlashStart(WS2812_ILLUMINATION_COLOR, WS2812_ILLUMINATION_BRIGHTNESS);
#elif WS2812_MODE == 0
                WS2812_TurnOn();
#else
                WS2812_TurnOn();
                vTaskDelay(pdMS_TO_TICKS(WS2812_INDICATOR_MS));
                WS2812_TurnOff();
#endif

#if TOF_CAPTURE_ACTIVATION_REFRESH
                if (consecutive_window_active) {
                    consecutive_captures++;
                } else {
                    consecutive_captures = 1;
                }
                consecutive_window_active = 0;
                printf("[ADAPT] Camera activation %u/%u\n",
                       (unsigned)consecutive_captures,
                       (unsigned)TOF_CAPTURE_MAX_DETECTIONS);
#endif

                PerfTimer_t t;
                PERF_START(t);
                int rc = Capture_RequestSnapshot(60000);
                PERF_STOP(t);
                BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
#if TOF_CAPTURE_ACTIVATION_REFRESH
                if (consecutive_captures >= TOF_CAPTURE_MAX_DETECTIONS) {
                    printf("[ADAPT] Maximum activations reached, refreshing baseline\n");
                    VL53L5CX_StopRanging();
                    vTaskDelay(pdMS_TO_TICKS(50));
                    VL53L5CX_StartRanging();
                    vTaskDelay(pdMS_TO_TICKS(200));
                    VL53L5CX_LearnBaseline();
                    consecutive_captures = 0;
                    consecutive_window_active = 0;
                    printf("[ADAPT] Baseline refresh complete\n");
                } else {
                    VL53L5CX_StartRanging();
                    consecutive_window_start = xTaskGetTickCount();
                    consecutive_window_active = 1;
                    printf("[ADAPT] Window opened for %lu s\n",
                           (unsigned long)TOF_CAPTURE_REFRESH_WINDOW_SECS);
                }
#else
                VL53L5CX_StartRanging();
#endif
                g_sensor_state = SENSOR_STATE_RUNNING;
                g_capture_busy = 0;
                cooldown = 5;

