SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
                if (rc == 0) {
                    capture_count++;
#if PERF_PRINT_SUMMARY
                    Perf_PrintSummary(&g_perf_timer, capture_count);
                    Perf_UpdateStats(&g_perf_timer);
#endif
                } else {
#if PERF_DEBUG_LEVEL >= 1
                    printf("[SENSOR] Capture FAILED rc=%d\n", rc);
#endif
                }
#endif /* TEST_TOF_MODE */
            }
        }
#else
        /* ---- SINGLE SENSOR MODE ----
           Standard VL53L5CX_Update() loop as before. */

        /* Update primary sensor */
        if (!VL53L5CX_Update()) { vTaskDelay(pdMS_TO_TICKS(10)); continue; }

#if !TEST_TOF_MODE && (WS2812_MODE == 0 || WS2812_MODE == 1)
        /* WS2812 has no readback. While the camera is idle, periodically
           overwrite any misdecoded residual colour with redundant OFF frames. */
        WS2812_OffWatchdog();
#endif

        g_debug_frame_count++;
        if (g_debug_frame_count >= 1) g_debug_frame_count = 0;
        if (cooldown > 0) cooldown--;

#if TOF_CAPTURE_REARM_HOLDOFF_SECS > 0
        if (capture_rearm_holdoff_active &&
            (xTaskGetTickCount() - capture_rearm_holdoff_start) >=
                pdMS_TO_TICKS(TOF_CAPTURE_REARM_HOLDOFF_SECS * 1000UL)) {
            capture_rearm_holdoff_active = 0;
            /* Discard weak evidence accumulated while photos were blocked.
               Preserve the learned baseline and the currently active weak
               zones so persistent 2% noise is not treated as a new edge. */
            VL53L5CX_ZoneDetectorAfterCapture();
            printf("[ADAPT] Camera re-armed; weak track cleared\n");
        }
#endif

#if TOF_CAPTURE_ACTIVATION_REFRESH
        if (consecutive_window_active &&
            (xTaskGetTickCount() - consecutive_window_start) >=
                pdMS_TO_TICKS(TOF_CAPTURE_REFRESH_WINDOW_SECS * 1000UL)) {
            consecutive_captures = 0;
            consecutive_window_active = 0;
            printf("[ADAPT] Window expired, counter reset\n");
        }
#endif

        /* Evaluate every fresh frame, including cooldown, so a persistent
           zone remains latched in both the ToF test and camera modes. */
#if !VL53L5CX_DUAL_SENSOR && (VL53L5CX_DET_RESOLUTION == 4) && \
    ((TEST_TOF_MODE && VL53L5CX_DET_HIGH_SENS_TEST) || \
     (!TEST_TOF_MODE && VL53L5CX_DET_HIGH_SENS_CAMERA))
        uint8_t tof_event_policy = 0U;
        if (cooldown == 0)
            tof_event_policy = VL53L5CX_TEST_EVENT_ALLOW_ALL;
#if TOF_CAPTURE_REARM_HOLDOFF_SECS > 0
        if (capture_rearm_holdoff_active && cooldown == 0)
            tof_event_policy = (VL53L5CX_TEST_EVENT_ALLOW_LEVEL |
                                VL53L5CX_TEST_EVENT_ALLOW_FAST);
#endif
        const int insect_detected = VL53L5CX_TestDetectionStep(tof_event_policy);
#if TOF_SCENE_GROUPING
        /* A scene ends only after six fresh frames without raw evidence or
           latches; camera/SD time does not count as a quiet observation. */
        if (VL53L5CX_TestSceneEvidenceMask() == 0U) {
            if (++scene_quiet_frames >= 6U) captured_scene_mask = 0U;
        } else {
            scene_quiet_frames = 0U;
        }
#endif
#else
        const int insect_detected = VL53L5CX_IsInsectDetected();
#endif
#if TEST_TOF_MODE && VL53L5CX_DET_ZONE_SURVEY && \
    (VL53L5CX_DET_RESOLUTION == 4) && \
    (VL53L5CX_DET_ZONE_LOG_INTERVAL_MS > 0)
        TickType_t zone_log_now = xTaskGetTickCount();
        if ((zone_log_now - zone_log_last) >=
            pdMS_TO_TICKS(VL53L5CX_DET_ZONE_LOG_INTERVAL_MS)) {
            zone_log_last = zone_log_now;
            VL53L5CX_PrintZoneSnapshot("periodic");
        }
#endif
#if !VL53L5CX_DUAL_SENSOR && (VL53L5CX_DET_RESOLUTION == 4) && \
    ((TEST_TOF_MODE && VL53L5CX_DET_HIGH_SENS_TEST) || \
     (!TEST_TOF_MODE && VL53L5CX_DET_HIGH_SENS_CAMERA))
        if (cooldown == 0 && !insect_detected &&
            VL53L5CX_TestBaselineRefreshReady() &&
#if TOF_SCENE_GROUPING
            (adaptive_refresh_pending ||
#endif
             VL53L5CX_TakeBaselineRefreshRequest() ||
             VL53L5CX_TestTakeBaselineRefreshRequest())) {
#else
        if (cooldown == 0 && VL53L5CX_TakeBaselineRefreshRequest()) {
#endif
#if TEST_TOF_MODE && VL53L5CX_DET_ZONE_SURVEY && \
    (VL53L5CX_DET_RESOLUTION == 4)
            VL53L5CX_PrintZoneSnapshot("drift");
#endif
            printf("[ADAPT] Scene quiet; checking baseline candidate\n");
            g_sensor_state = SENSOR_STATE_PAUSED;
            VL53L5CX_StopRanging();
            vTaskDelay(pdMS_TO_TICKS(50));
            VL53L5CX_StartRanging();
            vTaskDelay(pdMS_TO_TICKS(200));
            const int baseline_accepted = VL53L5CX_LearnBaseline();
#if TOF_SCENE_GROUPING
            if (!baseline_accepted) VL53L5CX_ZoneDetectorAfterCapture();
#endif
#if TOF_CAPTURE_ACTIVATION_REFRESH
            if (baseline_accepted) {
                consecutive_captures = 0;
                consecutive_window_active = 0;
            }
#endif
#if TOF_SCENE_GROUPING
            adaptive_refresh_pending = (uint8_t)!baseline_accepted;
#endif
            g_sensor_state = SENSOR_STATE_RUNNING;
            cooldown = 5;
            printf(baseline_accepted ? "[ADAPT] Baseline refresh complete\n" :
                   "[ADAPT] Baseline rejected; retry after a quiet interval\n");
#if TOF_CAPTURE_REARM_HOLDOFF_SECS > 0
            capture_rearm_holdoff_start = xTaskGetTickCount();
            capture_rearm_holdoff_active = 1;
            printf("[ADAPT] Level/track recovery for %lu s; ToF remains active\n",
                   (unsigned long)TOF_CAPTURE_REARM_HOLDOFF_SECS);
#endif
            continue;
        }

        /* Check primary sensor detection */
        if (insect_detected && cooldown == 0) {
            if (g_capture_busy) continue;
#if TOF_SCENE_GROUPING
            VL53L5CX_DetectionResult_t scene_result = VL53L5CX_GetResult();
            const uint16_t previous_scene_mask = captured_scene_mask;
            uint16_t event_zones = 0U;
            for (uint8_t i = 0U; i < scene_result.affected_count; i++)
                event_zones |= (uint16_t)(1U << scene_result.affected_zones[i]);
            if (captured_scene_mask != 0U && event_zones != 0U &&
                (VL53L5CX_TestGetLastEventClass() &
                 VL53L5CX_TEST_EVENT_CLASS_FAST_EDGE) == 0U &&
                (event_zones & (uint16_t)~ToFSceneNeighbours(captured_scene_mask)) == 0U) {
                printf("[ADAPT] Same scene %04X; photo already captured\n",
                       (unsigned)event_zones);
                continue;
            }
            captured_scene_mask |= event_zones;
#endif
            g_capture_busy = 1;
            g_sensor_state = SENSOR_STATE_PAUSED;
            VL53L5CX_DetectionResult_t res = VL53L5CX_GetResult();

#if PERF_DEBUG_LEVEL >= 1
            const char* trig_str;
            if (res.trigger_source == 1) trig_str = "SIGNAL";
            else if (res.trigger_source == 2) trig_str = "MOTION";
            else if (res.trigger_source == 3) trig_str = "SIGNAL+MOTION";
            else if (res.trigger_source == 4) trig_str = "DISTANCE";
            else if (res.trigger_source == 5) trig_str = "SIGNAL+DISTANCE";
            else if (res.trigger_source == 6) trig_str = "MOTION+DISTANCE";
            else if (res.trigger_source == 7) trig_str = "SIGNAL+MOTION+DISTANCE";
            else trig_str = "UNKNOWN";
            printf(">>> INSECT DETECTED [%s]!\n", trig_str);
#endif

