SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
#if TEST_TOF_MODE
            /* === ON-SITE TEST MODE: no camera, no SD — RED LED only ===
               Zone list shows WHERE in the FOV the target was, so sensor
               position/orientation can be validated. The WS2812 strip is
               not used in test mode. */
            printf(">>> TEST: %u zone(s) affected, %u valid\r\n",
                   (unsigned)res.affected_count, (unsigned)res.valid_measurements);
            for (int a = 0; a < res.affected_count; a++)
                printf("    zone %u -> %lu\r\n", (unsigned)res.affected_zones[a],
                       (unsigned long)res.affected_drop[a]);
            BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
            vTaskDelay(pdMS_TO_TICKS(TEST_TOF_LED_MS));
            BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
#if VL53L5CX_DET_ZONE_SURVEY && (VL53L5CX_DET_RESOLUTION == 4)
            VL53L5CX_PrintZoneSnapshot("trigger");
#if VL53L5CX_DET_ZONE_LOG_INTERVAL_MS > 0
            zone_log_last = xTaskGetTickCount();
#endif
#endif
            g_sensor_state = SENSOR_STATE_RUNNING;
            g_capture_busy = 0;
            cooldown = 30;
            continue;
#else
            /* Count completed activations across event classes. In the 4x4
               camera path, a third capture requests a safe refresh. */
#if !VL53L5CX_DUAL_SENSOR && (VL53L5CX_DET_RESOLUTION == 4) && \
    VL53L5CX_DET_HIGH_SENS_CAMERA
            const uint8_t tof_event_class = VL53L5CX_TestGetLastEventClass();
#else
            const uint8_t tof_event_class = 0U;
#endif
            BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
#if WS2812_MODE == 1
            WS2812_FlashStart(WS2812_ILLUMINATION_COLOR, WS2812_ILLUMINATION_BRIGHTNESS);
#elif WS2812_MODE == 0
            WS2812_TurnOn();
#else
            WS2812_TurnOn();
            vTaskDelay(pdMS_TO_TICKS(WS2812_INDICATOR_MS));
            WS2812_TurnOff();
#endif

#if TOF_CAPTURE_ACTIVATION_REFRESH
            if (consecutive_window_active) {
                consecutive_captures++;
            } else {
                consecutive_captures = 1;
            }
            consecutive_window_active = 0;
            printf("[ADAPT] Camera activation %u/%u class=%u\n",
                   (unsigned)consecutive_captures,
                   (unsigned)TOF_CAPTURE_MAX_DETECTIONS,
                   (unsigned)tof_event_class);
#endif

            PerfTimer_t t;
            PERF_START(t);
            int rc = Capture_RequestSnapshot(60000);
            PERF_STOP(t);
#if TOF_SCENE_GROUPING
            if (rc != 0) captured_scene_mask = previous_scene_mask;
#endif
#if VL53L5CX_DET_HIGH_SENS_CAMERA && (VL53L5CX_DET_RESOLUTION == 4)
            VL53L5CX_ZoneDetectorAfterCapture();
#endif
            /* sensor_task was blocked throughout camera/SD work. Do not compare
               the first new ToF sample with stale pre-capture history.
               ZoneDetectorAfterCapture already clears those comparisons while
               preserving active latches; a full reset here caused the same
               persistent evidence to trigger again after every photo. */
            BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
#if TOF_CAPTURE_ACTIVATION_REFRESH
            if (consecutive_captures >= TOF_CAPTURE_MAX_DETECTIONS) {
#if TOF_SCENE_GROUPING
                adaptive_refresh_pending = 1U;
                printf("[ADAPT] Maximum activations reached; baseline pending quiet scene\n");
                VL53L5CX_StartRanging();
#else
                printf("[ADAPT] Maximum activations reached, refreshing baseline\n");
                VL53L5CX_StopRanging();
                vTaskDelay(pdMS_TO_TICKS(50));
                VL53L5CX_StartRanging();
                vTaskDelay(pdMS_TO_TICKS(200));
                VL53L5CX_LearnBaseline();
                consecutive_captures = 0;
                consecutive_window_active = 0;
                printf("[ADAPT] Baseline refresh complete\n");
#if TOF_CAPTURE_REARM_HOLDOFF_SECS > 0
                capture_rearm_holdoff_start = xTaskGetTickCount();
                capture_rearm_holdoff_active = 1;
                printf("[ADAPT] Level/track recovery for %lu s; ToF remains active\n",
                       (unsigned long)TOF_CAPTURE_REARM_HOLDOFF_SECS);
#endif
#endif /* TOF_SCENE_GROUPING */
            } else {
                VL53L5CX_StartRanging();
                consecutive_window_start = xTaskGetTickCount();
                consecutive_window_active = 1;
                printf("[ADAPT] Window opened for %lu s\n",
                       (unsigned long)TOF_CAPTURE_REFRESH_WINDOW_SECS);
            }
#else
            VL53L5CX_StartRanging();
#endif
            g_sensor_state = SENSOR_STATE_RUNNING;
            g_capture_busy = 0;
            cooldown = 5;

            if (rc == 0) {
                capture_count++;
#if PERF_PRINT_SUMMARY
                Perf_PrintSummary(&g_perf_timer, capture_count);
                Perf_UpdateStats(&g_perf_timer);
#endif
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SENSOR] Capture FAILED rc=%d\n", rc);
#endif
            }
#endif /* TEST_TOF_MODE */
        }
#endif /* VL53L5CX_DUAL_SENSOR */

        vTaskDelay(pdMS_TO_TICKS(5));
    }
}


/* ==================== CAMERA TASK ==================== */
void camera_task(void *arg)
{
    (void)arg;
    extern volatile int system_ready;
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

    /* NOTE:
       - CAPTURE_MODE==1: camera already initialized in main_thread (pipe running).
         camera_task only services ISP in idle loop and handles snap commands.
       - CAPTURE_MODE==2: camera_task starts the continuous pipe here. */
#if CAPTURE_MODE == 2
    CAM_ContinuousStart(capture_buf, MAX_SNAP_FRAME_SIZE, SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS);
#endif

    uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;

    while (1) {
        CameraCmd_t cmd = {0};
#if CAPTURE_MODE == 1 || CAPTURE_MODE == 2
        CAM_IspUpdate();
#endif
        if (xQueueReceive(camera_cmd_queue, &cmd, pdMS_TO_TICKS(20)) != pdTRUE) continue;

        if (cmd.type == CAM_CMD_SNAP) {
            PERF_MARK(g_perf_timer, CAM_INIT);
            int rc = -1;
            g_last_batch_frames = 0;

#if CAPTURE_MODE == 1
            extern uint8_t save_buf[];
            rc = CAM_ContinuousSnap(save_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] OK %lu ms\n", (unsigned long)Perf_PhaseElapsed(&g_perf_timer, PERF_PHASE_START, PERF_PHASE_CAM_DEINIT));
#endif
                xSemaphoreGive(camera_ready_sem);
                StorageCmd_t sc = {0};
                sc.type = STORAGE_CMD_SAVE; sc.image_buf = save_buf;
                sc.image_size = frame_size; sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                sc.pixel_format = 0; sc.snap_id = g_next_snap_id++;
                sc.stamp = RTC_CaptureStamp();
                xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000));
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] FAIL\n");
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#elif CAPTURE_MODE == 2 || CAPTURE_MODE == 4
            extern uint8_t batch_buf[];
#if CAPTURE_MODE == 2
            rc = CAM_ContinuousBatchSnap(batch_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
#else
            /* CAPTURE_MODE == 4: Callback-Batch (continuous, NO stop/restart) */
            rc = CAM_CallbackBatchSnap(batch_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
#endif
            if (rc > 0) {
                g_last_batch_frames = rc;
#if PERF_DEBUG_LEVEL >= 1
#if CAPTURE_MODE == 4
                printf("[CAM] Callback-Batch: %d frames captured (continuous)\n", rc);
#else
                printf("[CAM] Batch: %d frames captured\n", rc);
#endif
#endif
                xSemaphoreGive(camera_ready_sem);
                RTC_Stamp stamp = RTC_CaptureStamp();
                uint32_t first_id = g_next_snap_id;
                g_next_snap_id += (uint32_t)rc;
                for (int f = 0; f < rc; f++) {
                    StorageCmd_t sc = {0};
                    sc.type = STORAGE_CMD_SAVE;
                    sc.image_buf = batch_buf + (f * frame_size);
                    sc.image_size = frame_size;
                    sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                    sc.pixel_format = 0; sc.snap_id = first_id + (uint32_t)f;
#if CAPTURE_MODE == 4
                    sc.stamp = RTC_StampForFrame(stamp, CAM_GetCallbackFrameTick((uint32_t)f));
#else
                    sc.stamp = stamp;
#endif
                    if (xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000)) != pdTRUE) {
#if PERF_DEBUG_LEVEL >= 1
                        printf("[CAM] Storage queue full, dropping frame %d\n", f);
#endif
                    }
                }
            } else {
#if PERF_DEBUG_LEVEL >= 1
#if CAPTURE_MODE == 4
                printf("[CAM] Callback-Batch FAIL\n");
#else
                printf("[CAM] Batch FAIL\n");
#endif
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#else
            rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE, SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS, SNAP_WARMUP_FRAMES);
            PERF_MARK(g_perf_timer, CAM_END);
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] OK %lu ms\n", (unsigned long)Perf_PhaseElapsed(&g_perf_timer, PERF_PHASE_START, PERF_PHASE_CAM_DEINIT));
#endif
                xSemaphoreGive(camera_ready_sem);
                StorageCmd_t sc = {0};
                sc.type = STORAGE_CMD_SAVE; sc.image_buf = capture_buf;
                sc.image_size = frame_size; sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                sc.pixel_format = 0; sc.snap_id = g_next_snap_id++;
                sc.stamp = RTC_CaptureStamp();
                xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000));
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] FAIL\n");
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#endif
        }
    }
}

/* ==================== STORAGE TASK ==================== */
void storage_task(void *arg)
{
    (void)arg;
    extern volatile int system_ready;
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

    while (1) {
        StorageCmd_t cmd = {0};
        if (xQueueReceive(storage_cmd_queue, &cmd, portMAX_DELAY) != pdTRUE) continue;
        if (cmd.type == STORAGE_CMD_SAVE) {
            PERF_MARK(g_perf_timer, STORAGE);
            uint32_t storage_start = HAL_GetTick();
            int rc = SD_StoreRawImage(cmd.image_buf, cmd.image_size, cmd.width, cmd.height, cmd.pixel_format, cmd.snap_id, cmd.stamp);
            if (rc != 0) {
                /* A single transient card hiccup (timeout / CRC) previously meant this
                   image was silently lost. Reinit the peripheral and retry the SAME
                   image ONCE before giving up, since g_sd_img_base_block was restored
                   to the block this image was supposed to start at. */
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] FAIL — attempting recovery + retry...\n");
#endif
                if (SD_Reinit() == 0) {
                    rc = SD_StoreRawImage(cmd.image_buf, cmd.image_size, cmd.width, cmd.height, cmd.pixel_format, cmd.snap_id, cmd.stamp);
                }
            }
            if (rc != 0) g_last_storage_rc = rc;
#if PERF_DEBUG_LEVEL >= 1
            uint32_t storage_elapsed = HAL_GetTick() - storage_start;
#endif
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] OK %lu ms\n", (unsigned long)storage_elapsed);
#endif
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] FAIL %lu ms — image LOST after retry\n", (unsigned long)storage_elapsed);
#endif
                SD_Reinit();
            }
            Perf_StorageComplete(&g_perf_timer, HAL_GetTick() - storage_start, cmd.image_size, rc == 0);
            xSemaphoreGive(storage_done_sem);
        }
    }
}

